#include"head.h"

/*---------欢迎菜单------------------*/
void menu_build()
{
    printf("*****************************************");
    printf("*****************************************");
	printf("**********欢迎使用一夜暴富彩票机***********");
    printf("*****************************************");
    printf("*****************************************");
}
/*---------主菜单------------------*/
void main_menu()
{
	printf("1、管理员登陆\n");
    printf("2、彩民登陆\n");
    printf("3、用户注册\n");
    printf("4、退出系统\n");
}
/*---------管理员登录子菜单----------*/
void menu1()
{
	printf("1、摇号\n");
    printf("2、查看信息");
    printf("3、修改信息");
    printf("4、删除信息");
    printf("5、购票信息排序");
    printf("0、返回首页");
}

/*---------彩民登录子菜单------------*/
void menu2()
{
	printf("1、购票\n");
    printf("2、查看个人信息");
    printf("3、修改信息");
    printf("0、返回首页");
}

/*---------menu21用户购票子菜单--------*/
void menu21()
{
	printf("********************************\n");
	printf("***********第%d期彩票 ***********\n",ticketdayth);
	printf("********************************\n");
	printf("1、体 育 彩 票\n");
	printf("2、慈 善 彩 票\n");
	printf("3、救 灾 彩 票\n\n");
	printf("0、返 回 上 一 级\n");
	printf("********************************");
	printf("请选择：");
}

/*---------menu23修改用户个人信息子菜单--------*/
void menu23()
{
	printf("1、修改姓名\n");
    printf("2、修改密码\n");
    printf("0、返回首页\n");
}

/*---------menu1查看信息子菜单----------------*/
void menu12()
{
	printf("1、管理员信息\n");
    printf("2、历史中奖信息\n");
    printf("3、历史中奖者信息\n");
    printf("4、彩民基本信息\n");
    printf("5、所有购票信息\n");
    printf("6、按ID查找\n");
    printf("7、按期号查找\n");
    printf("0、返回上一级");
}
/*---------menu1修改信息子菜单----------------*/
void menu13()
{
	printf("1、修改管理员信息\n");
    printf("2、修改彩民密码\n");
    printf("3、追加金额\n");
    printf("0、返回上一级\n");
}

/*---------menu131修改管理员信息子菜单----------*/
void menu131()
{
	printf("修改管理员信息\n");
	printf("***********************************\n");
	printf("1、修 改 姓 名\n");
	printf("2、修 改 密 码\n");
	printf("3、修 改 奖 池 金 额\n");
	printf("0、返 回 上 一 级\n");
	printf("***********************************\n");
	printf("请选择：");
}

/*---------menu1删除信息子菜单------------------*/
void menu14()
{
	printf("1、删除注册用户\n");
    printf("2、根据ID删除购票信息\n");
    printf("3、根据类型删除购票信息\n");
    printf("4、根据期号删除购票信息\n");
    printf("0、返回上一级\n");
}

/*---------menu1排序信息子菜单------------------*/
void menu15()
{
	printf("1、按账号余额排序\n");
    printf("2、按期号排序\n");
    printf("3、按购票总数排序\n");
    printf("0、返回上一级\n");
}

/*---------密码错误提示子菜单------------------*/
void key_error()
{
	printf("密码输入错误！\n");
}
/*---------注册成功提示子菜单------------------*/
void apply_success()
{
	printf("注册成功！\n");
}

/*---------退出感谢子菜单------------------*/
void thanks()
{
	printf("感谢使用彩票机，欢迎您下次再来！\n");
}
/*---------系统摇奖子菜单------------------*/
void luck_draw()
{
	printf("正在抽取号码，请稍后...\n");
}

/*---------文件打开子函数------------------*/
void menu_open(char *address)
{
	FILE *fp;
	if((fp = fopen(address,"rt"))==NULL)
	{
		printf("打开文件失败！");
		exit(0);
	}
	while(!feof(fp))
	{
		printf("%c",fgetc(fp));
	}
	fclose(fp);
	printf("请选择-->");
}